[
  {
    "prayerId": 1,
    "sortId": 1,
    "title": "Praise and Worship",
    "detailText": "Praise - is an act of commitment to God.\n\nThrough praise we acknowledge God for who He is, exalt Him with our words, our whole being, and our attitude in prayer. All prayer should start with praise.\n\nPsalm 115:1 says: \"Not to us, O Lord, not to us but to Your Name be the Glory, because of Your Love and Faithfulness\". \n\nWe praise Him for His Name, His Justice, Love, Holiness, Omnipotence, Greatness, Faithfulness, His Word, His Creation, His Redemption, etc.\nYou can for instance, use a different theme each time in this time span of Praise and Worship. Expand on this theme as much as possible, meditate on it, weigh the practical implications of it on your life and the lives of others. Watch out, though for a mere repetition of words.",
    "youtubeId": ""
  },
  {
    "prayerId": 2,
    "sortId": 1,
    "title": "Waiting on the Lord",
    "detailText": "Waiting on the Lord - is an act of silent love or adoration of God.\n\nIt incorporates worship and praise to God for who He is. It is to worship God and to praise Him for who He is. During this period of silence we tune in to (adjust ourselves to) God Himself, we direct our whole being to Him and commit ourselves to Him anew. We rejoice in and over His Presence. \n\nPsalm 46:10 says: \"Be still and know that I am God.\"\n\nWe can say that this is a very intimate form of communication between God and ourselves, it is I, as the limited (shackled) and finite being before God who is the Unlimited and Infinite Being. We make sure at this point that we are in contact with God. This time of waiting on the Lord cannot be hurried, there is no place for impatience and haste here. During this time you think of nothing else but God The Father, His Son Jesus your Redeemer, and The Holy Spirit. You need not express your thoughts in words. Concentrate on your relationship with God and your love for Him.",
    "youtubeId": "Hello World"
  },
    {
    "prayerId": 3,
    "sortId": 1,
    "title": "Confession",
    "detailText": "Confession is the condition to admission to God.\n\nThis is a time of self-examination (introspection) and allowing the Holy Spirit to point out any unconfessed sin to you.\nI acknowledge my sin and sinfulness before the Lord during this period; \nI confess my sin and turn my back on it; \nI break with my sin and accept the Lords' forgiveness.\n\nConfession is the cleansing of the Christian. Sin builds a wall between us and God so that God will not hear us (Isaiah 59:1-2). Our sins are paid for and forgiven solely through the blood of the Lord Jesus Christ on the grounds of his death on the Cross. I don't ask God to change the circumstances during confession but that He will forgive and change me. Confess each form of failure, negligence and sin.",
    "youtubeId": "Hello World"
  },
  {
    "prayerId": 4,
    "sortId": 1,
    "title": "Praying Scripture",
    "detailText": "Praying Scripture - To be able to pray in a balanced way, I have to spend time in The Word. I must get to know God's promises and pray them to God. The Promises of God create faith. In the first place The Bible is a Book that has to be believed and obeyed.\n\nDuring this period I ask: \"Lord what promises can I make my own; what commands must I obey, what warnings must I pay attention to?\"\n\nThe Word is our prayer manual. We must remind the Lord of His promises in His Word day and night. As you read Scripture, ask the Lord how to apply it in your life and in your prayer time. Your prayers must become quotations from Scripture more and more.",
    "youtubeId": "Hello World"
  },
    {
    "prayerId": 5,
    "sortId": 1,
    "title": "Watching",
    "detailText": "Watching - a time of spiritual perception (observation) to be spiritually aware of matters to pray for.\n\nWatching will lead to praying for the needs of others and some of your own needs. You tune into the Lord and ask The Holy spirit specifically to draw your attention to specific matters so that you can pray for them.\n\nBe especially wary and alert for the onslaughts of the evil one during this time. Pray and ask The Holy Spirit to show you the plans, methods, strongholds and strategies of the evil one. Paul teaches us to watch and pray with thanksgiving.\n\"Devote yourselves to prayer, being watchful and thankful\" (Col.4:2)\n\nSatan will certainly try to keep you from praying and confuse you so that you can not concentrate. Be wary, rebuke and resist him. Be sure to pray purposefully. What are the problems people experience while teaching the Gospel? Pray for that. Are there things reported in the newspapers, things that we hear on the radio or see on the television that we should pray for; things like economic problems, political unrest, wars, etc.",
    "youtubeId": "Hello World"
  },
  {
    "prayerId": 6,
    "sortId": 1,
    "title": "Intercession",
    "detailText": "Intercession - to intercede for others, to pray for other.\n\nIn intercession we concentrate on the needs and distress of others - we stand in the gap for someone else. Intercession is God's method to get His children involved in His plan for the World. We become involved in World evangelization during intercession. When you intercede you stand at God's side and you work with Him for the salvation or the benefit of some else. By faithful intercession you can do as much as those who are physically in the field.\n\nWork out a systematic plan for intercession, start with your own household and family, then your friends and church, then your town, your country and lastly the whole World. Every Christian should have a burden for lost souls and a World in need. Remember the church of the Lord also needs intercession. Intercession is not only on behalf of unbelievers. Spiritual warfare is an element of intercessory prayer that deserves a specific place in our prayer time.\n\nPray and ask the Lord to show you through the working of The Holy Spirit where the powers of evil are working. Binding evil forces in Jesus' Name, break their strongholds and resist them. Resist the devil, don't give him a hold in your life. Jesus conquered the evil one on the Cross. We as believers must proclaim his victory in each area of life. Spiritual warfare will also be part of your prayer time during Watching and Petition.",
    "youtubeId": "Hello World"
  },
    {
    "prayerId": 7,
    "sortId": 1,
    "title": "Petitions",
    "detailText": "Petition - for your personal needs.\n\nThe believer may and should come to his Father and pray for his own personal needs. And he can pray expectantly, even for the smallest things. During this period we pray for our \"daily bread\" and we also pray for spiritual strengthening and equipment for our lives and work as believers. I look to the Lord in total dependence to meet my needs. We must never ask out of selfishness. No, our requests must bring Praise to Our Father.\n\nAnticipate what your needs are going to be during the day in this period and pray for them. John Rice said: \"Prayer is asking and receiving.\" Tell the Lord why you ask these things from Him, thus ensuring that your intentions are pure. Come with frankness as our Father wants to meet our needs gladly.",
    "youtubeId": "Hello World"
  },
  {
    "prayerId": 8,
    "sortId": 1,
    "title": "Thanksgiving",
    "detailText": "Thanksgiving - is to acknowledge your appreciation to the Lord for what He has done for you and others.\n\nDuring this period I thank God for who He is, His gifts, His answers to my prayers, His care and provision. Thank the Lord for spiritual, material, physical and any other blessings. Be specific in your thanksgiving and beware of generalizations. Tell the Lord why you are grateful. Think about the day or days gone by and thank the Lord for everything which you have received from Him. ",
    "youtubeId": "Hello World"
  },
    {
    "prayerId": 9,
    "sortId": 1,
    "title": "Song",
    "detailText": "Song - is melodious Worship.\n\nSong does not have to be used during communal worship only. The intercessor can sing his own (new) song to the Lord or make use of existing songs as circumstances determine. Song and Spiritual warfare (our battle with the evil one) are inextricably linked to each other.\n\nDuring this period one Praises, Worships, Exalts and Adores his Father in song. Your singing can take the form of praise songs, songs that testify to God's power and grace, thanksgiving and songs about God's Name.\n\nTo sing to the Glory of the Lord is definitely a command from God (Ps.100). Sing enthusiastically and heartily, because you are Exalting God. The attitude of your heart and the fact that you are carrying out His instructions are of greater value to the Lord than whether you can sing beautifully or can sing in tune. ",
    "youtubeId": "Hello World"
  },
  {
    "prayerId": 10,
    "sortId": 1,
    "title": "Meditation",
    "detailText": "Meditation - means to reflect upon or examine a matter more closely (deeply) to evaluate it spiritually.\n\nDuring this period I think about the Being and the nature of the Triune God, his creation and great deeds. You can use a portion of Scripture to reflect upon, a Psalm for instance, but also other portions.\n\nChristian meditation is the opposite of Eastern meditation. To the Christian, meditation is an active process of evaluation, searching and pondering, where he uses his full intellect and is led by Scripture and the Holy Spirit in his meditation.\n\nMeditation is to ponder in a disciplined way. Beware that Satan does not plant his thoughts into your mind. Also beware of negative thoughts during this time. Consider everything that is true, pure, noble, right, beautiful and praise worthy. When you meditate on a certain portion of Scripture you must ask yourself among other things what this portion means to you.",
    "youtubeId": "Hello World"
  },
    {
    "prayerId": 11,
    "sortId": 1,
    "title": "Listening",
    "detailText": "Listening - is a period during which you ask the Lord to reveal new things to you, things that He wants you to notice and pay attention to.\n\nYou deliberately ask God to reveal His Will and Strategies/Plans to you. In waiting on The Lord the emphasis is on loving God. During meditation we want to learn more from God. During the period of listening we want to hear what God wants to say to us.\n\nDuring this period I ask: \"Lord, what do you expect from me; What is Your Will for me?\" You can also ask the Lord specific questions, perhaps some difficult questions that you do not have the answers to.\n\nBe sensitive to the Holy Spirit. Write down all the thoughts that come from the Lord in your opinion, and put them to the test in the Scripture. Use them as directives for the execution of God's command. Be careful not to say immediately that: \"The Lord said this and that to me.\" Always test if the Lord is still with you in the matter and be prepared to make a change of course, if necessary. ",
    "youtubeId": "Hello World"
  },
  {
    "prayerId": 12,
    "sortId": 1,
    "title": "Praise",
    "detailText": "Worship - to exalt God and say of Him: \"I know who I am praying to and I Trust Him with my prayers/supplications.\"\n\nThis is a period of  jubilation before the Lord. Let your AMEN be strong at the end and confirm thus that you believe that God has heard you and will answer you. Amen means - it is true and sure, so shall it be. ",
    "youtubeId": ""
  }
]


